{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "40a385ba",
   "metadata": {},
   "source": [
    "# Devoir maison pour le compte du cours de DBS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5239750f",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install pandas rdflib"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ca9177fb",
   "metadata": {},
   "source": [
    "# 0. Import des bibliothèques"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "1f133985",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import la librarie rdflib\n",
    "from rdflib import Graph, Literal, RDF, URIRef, Namespace, XSD"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "497b6e5c",
   "metadata": {},
   "source": [
    "## 1 Choix des jeux de données"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "38cbf9b8",
   "metadata": {},
   "source": [
    "### Les sources de données\n",
    "\n",
    "1) NBA games data, Nathan Lugan (Kaggle)\n",
    "Link : https://www.kaggle.com/datasets/nathanlauga/nba-games?select=games.csv\n",
    "\n",
    "Colonnes d'intéret : \n",
    "\n",
    "GAME_DATE_EST : Le jour du match\n",
    "\n",
    "GAME_ID : L'identifiant du match\n",
    "\n",
    "HOME_TEAM_ID : L'identifiant de l'équipe à domicile\n",
    "\n",
    "VISITOR_TEAM_ID : L'identifiant de l'équipe à l'exterieur\n",
    "\n",
    "SEASON : La saison\n",
    "\n",
    "PTS_home : Nombre de points dans le match de l'équipe à domicile\n",
    "\n",
    "PTS_away : Nombre de points dans le match de l'équipe à l'exterieur\n",
    "\n",
    "HOME_TEAM_WINS : Valeur booléenne qui si l'équipe à domicile à gagné le match (1) ou non (0)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ca6f215",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "06b83805",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"\\n2) NBA Dataset - Box Scores & Stats, 1947 - Today, Justinas Cirtautas (Kaggle). Link : https://www.kaggle.com/datasets/eoinamoore/historical-nba-data-and-player-box-scores\\n\\ngameId : Identifant du match\\nhometeamCity : Ville de l'équipe à domicile\\nhometeamName : Nom de l'équipe à l'exterieur\\nhometeamId : Identifiant de l'équipe à domicile\\nawayteamCity : Ville de l'équipe à l'exterieur\\nawayteamName : Nom de l'équipe à l'exterieur\\nawayteamId : Identifiant de l'équipe à l'exterieur\\n\\n\""
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\"\"\"\n",
    "2) NBA Dataset - Box Scores & Stats, 1947 - Today, Justinas Cirtautas (Kaggle). Link : https://www.kaggle.com/datasets/eoinamoore/historical-nba-data-and-player-box-scores\n",
    "\n",
    "gameId : Identifant du match\n",
    "hometeamCity : Ville de l'équipe à domicile\n",
    "hometeamName : Nom de l'équipe à l'exterieur\n",
    "hometeamId : Identifiant de l'équipe à domicile\n",
    "awayteamCity : Ville de l'équipe à l'exterieur\n",
    "awayteamName : Nom de l'équipe à l'exterieur\n",
    "awayteamId : Identifiant de l'équipe à l'exterieur\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ccea185",
   "metadata": {},
   "source": [
    "3) NBA Database, Wyatt Walsh (Kaggle). Lien : https://www.kaggle.com/datasets/wyattowalsh/basketball\n",
    "\n",
    "    person_id : Identifiant de chaque joueur\n",
    "\n",
    "    first_name : Prénom du joueur\n",
    "\n",
    "    last_name : Nom du joueur\n",
    "\n",
    "    birthdate : Date d'anniversaire\n",
    "\n",
    "    school : L'université de laquelle le joueur vient\n",
    "\n",
    "    height : La taille du joueur\n",
    "\n",
    "    position : Sa position\n",
    "\n",
    "    team_id : L'identifiant de son équipe\n",
    "\n",
    "    team_name : Le nom de son équipe\n",
    "\n",
    "    team_city : Ville de son équipe\n",
    "\n",
    "    team_abbreviation : L'abréviation de son équipe\n",
    "\n",
    "    draft_year : L'année de draft du joueur\n",
    "\n",
    "    draft_round : Le tour auquel le joueur a été drafté\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d9b1b005",
   "metadata": {},
   "source": [
    "# II. Passe au code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ef83c912",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "pd.set_option(\"display.max_rows\", None) # Afficher toutes les lignes\n",
    "pd.set_option(\"display.max_columns\", None) # Afficher toutes les colonnes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8f906fd9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 4171 entries, 0 to 4170\n",
      "Data columns (total 13 columns):\n",
      " #   Column             Non-Null Count  Dtype \n",
      "---  ------             --------------  ----- \n",
      " 0   person_id          4171 non-null   int64 \n",
      " 1   first_name         4171 non-null   object\n",
      " 2   last_name          4171 non-null   object\n",
      " 3   birthdate          4171 non-null   object\n",
      " 4   school             4156 non-null   object\n",
      " 5   height             4075 non-null   object\n",
      " 6   position           4108 non-null   object\n",
      " 7   team_id            4171 non-null   int64 \n",
      " 8   team_name          3469 non-null   object\n",
      " 9   team_city          3469 non-null   object\n",
      " 10  team_abbreviation  3469 non-null   object\n",
      " 11  draft_year         4171 non-null   object\n",
      " 12  draft_round        4007 non-null   object\n",
      "dtypes: int64(2), object(11)\n",
      "memory usage: 423.7+ KB\n"
     ]
    }
   ],
   "source": [
    "# Import the dataset of players\n",
    "\n",
    "players = pd.read_csv(\"./csv_datasets/Players.csv\")\n",
    "players = players[[\"person_id\", \"first_name\", \"last_name\", \"birthdate\", \"school\", \"height\", \"position\", \"team_id\", \"team_name\", \"team_city\", \"team_abbreviation\", \"draft_year\", \"draft_round\"]]\n",
    "players.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "3154e445",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 26651 entries, 0 to 26650\n",
      "Data columns (total 8 columns):\n",
      " #   Column           Non-Null Count  Dtype  \n",
      "---  ------           --------------  -----  \n",
      " 0   GAME_DATE_EST    26651 non-null  object \n",
      " 1   GAME_ID          26651 non-null  int64  \n",
      " 2   HOME_TEAM_ID     26651 non-null  int64  \n",
      " 3   VISITOR_TEAM_ID  26651 non-null  int64  \n",
      " 4   SEASON           26651 non-null  int64  \n",
      " 5   PTS_home         26552 non-null  float64\n",
      " 6   PTS_away         26552 non-null  float64\n",
      " 7   HOME_TEAM_WINS   26651 non-null  int64  \n",
      "dtypes: float64(2), int64(5), object(1)\n",
      "memory usage: 1.6+ MB\n"
     ]
    }
   ],
   "source": [
    "# Import the Dataset games\n",
    "games = pd.read_csv(\"./csv_datasets/Games.csv\")\n",
    "games = games[[\"GAME_DATE_EST\", \"GAME_ID\", \"HOME_TEAM_ID\", \"VISITOR_TEAM_ID\", \"SEASON\", \"PTS_home\", \"PTS_away\", \"HOME_TEAM_WINS\"]]\n",
    "games.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3ccbc9bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Index: 26552 entries, 0 to 26650\n",
      "Data columns (total 8 columns):\n",
      " #   Column           Non-Null Count  Dtype  \n",
      "---  ------           --------------  -----  \n",
      " 0   GAME_DATE_EST    26552 non-null  object \n",
      " 1   GAME_ID          26552 non-null  int64  \n",
      " 2   HOME_TEAM_ID     26552 non-null  int64  \n",
      " 3   VISITOR_TEAM_ID  26552 non-null  int64  \n",
      " 4   SEASON           26552 non-null  int64  \n",
      " 5   PTS_home         26552 non-null  float64\n",
      " 6   PTS_away         26552 non-null  float64\n",
      " 7   HOME_TEAM_WINS   26552 non-null  int64  \n",
      "dtypes: float64(2), int64(5), object(1)\n",
      "memory usage: 1.8+ MB\n"
     ]
    }
   ],
   "source": [
    "games.dropna(inplace=True)\n",
    "games.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "736f87e8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Index: 3311 entries, 0 to 4169\n",
      "Data columns (total 13 columns):\n",
      " #   Column             Non-Null Count  Dtype \n",
      "---  ------             --------------  ----- \n",
      " 0   person_id          3311 non-null   int64 \n",
      " 1   first_name         3311 non-null   object\n",
      " 2   last_name          3311 non-null   object\n",
      " 3   birthdate          3311 non-null   object\n",
      " 4   school             3311 non-null   object\n",
      " 5   height             3311 non-null   object\n",
      " 6   position           3311 non-null   object\n",
      " 7   team_id            3311 non-null   int64 \n",
      " 8   team_name          3311 non-null   object\n",
      " 9   team_city          3311 non-null   object\n",
      " 10  team_abbreviation  3311 non-null   object\n",
      " 11  draft_year         3311 non-null   object\n",
      " 12  draft_round        3311 non-null   object\n",
      "dtypes: int64(2), object(11)\n",
      "memory usage: 362.1+ KB\n"
     ]
    }
   ],
   "source": [
    "players.dropna(inplace=True)\n",
    "players.info()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "257f018f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "45"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "players[\"team_id\"].nunique()    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "e89dce5e",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\chris.DESKTOP-GCU74DF\\AppData\\Local\\Temp\\ipykernel_6968\\3961569438.py:8: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  players_cleaned[\"draft_round\"] = players_cleaned[\"draft_round\"].replace(\"Undrafted\", \"-1\")\n",
      "C:\\Users\\chris.DESKTOP-GCU74DF\\AppData\\Local\\Temp\\ipykernel_6968\\3961569438.py:11: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  players_cleaned[\"birthdate\"] = pd.to_datetime(players_cleaned[\"birthdate\"])\n"
     ]
    }
   ],
   "source": [
    "# Sets de team_id présents dans games\n",
    "games_teams = set(games[\"HOME_TEAM_ID\"].unique()).union(set(games[\"VISITOR_TEAM_ID\"].unique()))\n",
    "\n",
    "# Filtrer players pour ne garder que les team_id présents dans games\n",
    "players_cleaned = players[players[\"team_id\"].isin(games_teams)]\n",
    "\n",
    "# Remplacer les valeurs \"undrafted\" par None dans la colonne draft_round\n",
    "players_cleaned[\"draft_round\"] = players_cleaned[\"draft_round\"].replace(\"Undrafted\", \"-1\")\n",
    "\n",
    "# Convertir la colonne birthday en datetime\n",
    "players_cleaned[\"birthdate\"] = pd.to_datetime(players_cleaned[\"birthdate\"])\n",
    "\n",
    "# Sauvegarder si besoin\n",
    "players_cleaned.to_csv(\"players_cleaned.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "0d976c5a",
   "metadata": {},
   "outputs": [],
   "source": [
    "players = pd.read_csv(\"players_cleaned.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "c9a2fe1c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Extraire les colonnes équipe depuis player.csv\n",
    "teams_from_players = players[[\"team_id\", \"team_name\", \"team_city\", \"team_abbreviation\"]].drop_duplicates()\n",
    "\n",
    "# Extraire les équipes présentes dans game.csv\n",
    "home_teams = games[[\"HOME_TEAM_ID\"]].rename(columns={\"HOME_TEAM_ID\": \"team_id\"})\n",
    "visitor_teams = games[[\"VISITOR_TEAM_ID\"]].rename(columns={\"VISITOR_TEAM_ID\": \"team_id\"})\n",
    "teams_from_games = pd.concat([home_teams, visitor_teams]).drop_duplicates()\n",
    "\n",
    "# Fusionner pour avoir toutes les équipes\n",
    "teams = pd.merge(teams_from_games, teams_from_players, on=\"team_id\", how=\"left\")\n",
    "\n",
    "# Sauvegarder en CSV\n",
    "teams_unique = teams.groupby(\"team_id\").agg(lambda x: x.mode()[0]).reset_index()\n",
    "teams_unique.to_csv(\"team.csv\", index=False)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "3a567a35",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['GAME_DATE_EST', 'GAME_ID', 'HOME_TEAM_ID', 'VISITOR_TEAM_ID', 'SEASON',\n",
       "       'PTS_home', 'PTS_away', 'HOME_TEAM_WINS'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "games.columns"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "73c8fea1",
   "metadata": {},
   "source": [
    "# Merge both dataset\n",
    "\n",
    "nba_df = games.merge(players, on=\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "1cdcbd84",
   "metadata": {},
   "outputs": [],
   "source": [
    "#players[\"team_id\"].nunique()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "00b55be8",
   "metadata": {},
   "outputs": [],
   "source": [
    "game = pd.read_csv(\"./csv_datasets/Games.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "d5d81811",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "GAME_DATE_EST        0\n",
       "GAME_ID              0\n",
       "GAME_STATUS_TEXT     0\n",
       "HOME_TEAM_ID         0\n",
       "VISITOR_TEAM_ID      0\n",
       "SEASON               0\n",
       "TEAM_ID_home         0\n",
       "PTS_home            99\n",
       "FG_PCT_home         99\n",
       "FT_PCT_home         99\n",
       "FG3_PCT_home        99\n",
       "AST_home            99\n",
       "REB_home            99\n",
       "TEAM_ID_away         0\n",
       "PTS_away            99\n",
       "FG_PCT_away         99\n",
       "FT_PCT_away         99\n",
       "FG3_PCT_away        99\n",
       "AST_away            99\n",
       "REB_away            99\n",
       "HOME_TEAM_WINS       0\n",
       "dtype: int64"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "game.isna().sum() "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "eae233d4",
   "metadata": {},
   "outputs": [],
   "source": [
    "player = pd.read_csv(\"./csv_datasets/player.csv\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "517f0be5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "person_id            0\n",
       "first_name           0\n",
       "last_name            0\n",
       "birthdate            0\n",
       "school               0\n",
       "height               0\n",
       "position             0\n",
       "team_id              0\n",
       "team_name            0\n",
       "team_city            0\n",
       "team_abbreviation    0\n",
       "draft_year           0\n",
       "draft_round          0\n",
       "dtype: int64"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "players.isna().sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "4ceec2ff",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "id            0\n",
       "full_name     0\n",
       "first_name    6\n",
       "last_name     0\n",
       "is_active     0\n",
       "dtype: int64"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "player.isna().sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "b20d5024",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "GAME_DATE_EST      0\n",
       "GAME_ID            0\n",
       "HOME_TEAM_ID       0\n",
       "VISITOR_TEAM_ID    0\n",
       "SEASON             0\n",
       "PTS_home           0\n",
       "PTS_away           0\n",
       "HOME_TEAM_WINS     0\n",
       "dtype: int64"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "games.isna().sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "38b89b89",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>full_name</th>\n",
       "      <th>first_name</th>\n",
       "      <th>last_name</th>\n",
       "      <th>is_active</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>76001</td>\n",
       "      <td>Alaa Abdelnaby</td>\n",
       "      <td>Alaa</td>\n",
       "      <td>Abdelnaby</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>76002</td>\n",
       "      <td>Zaid Abdul-Aziz</td>\n",
       "      <td>Zaid</td>\n",
       "      <td>Abdul-Aziz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>76003</td>\n",
       "      <td>Kareem Abdul-Jabbar</td>\n",
       "      <td>Kareem</td>\n",
       "      <td>Abdul-Jabbar</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>51</td>\n",
       "      <td>Mahmoud Abdul-Rauf</td>\n",
       "      <td>Mahmoud</td>\n",
       "      <td>Abdul-Rauf</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1505</td>\n",
       "      <td>Tariq Abdul-Wahad</td>\n",
       "      <td>Tariq</td>\n",
       "      <td>Abdul-Wahad</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      id            full_name first_name     last_name  is_active\n",
       "0  76001       Alaa Abdelnaby       Alaa     Abdelnaby          0\n",
       "1  76002      Zaid Abdul-Aziz       Zaid    Abdul-Aziz          0\n",
       "2  76003  Kareem Abdul-Jabbar     Kareem  Abdul-Jabbar          0\n",
       "3     51   Mahmoud Abdul-Rauf    Mahmoud    Abdul-Rauf          0\n",
       "4   1505    Tariq Abdul-Wahad      Tariq   Abdul-Wahad          0"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "player.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "46aaf478",
   "metadata": {},
   "outputs": [],
   "source": [
    "games.to_csv(\"games_cleaned.csv\", index=False)\n",
    "players.to_csv(\"players_cleaned.csv\", index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e7e27ce",
   "metadata": {},
   "source": [
    "# Part 2 : Conversion de CSV à RDF\n",
    "\n",
    "L'objectif de cette partie est de definir un graphe RDF noté g, qui va capturer toutes les données de nos tables csv Games, Players et Teams qui seront représentées en RDF comme des classes ayant des propriétés.\n",
    "\n",
    "Chaque individu aura un identifiant unique appelé URI formé de l'url du namespace et de son id unique, et des valeurs des propriétés de sa classe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "e305eb15",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Index: 26552 entries, 0 to 26650\n",
      "Data columns (total 8 columns):\n",
      " #   Column           Non-Null Count  Dtype  \n",
      "---  ------           --------------  -----  \n",
      " 0   GAME_DATE_EST    26552 non-null  object \n",
      " 1   GAME_ID          26552 non-null  int64  \n",
      " 2   HOME_TEAM_ID     26552 non-null  int64  \n",
      " 3   VISITOR_TEAM_ID  26552 non-null  int64  \n",
      " 4   SEASON           26552 non-null  int64  \n",
      " 5   PTS_home         26552 non-null  float64\n",
      " 6   PTS_away         26552 non-null  float64\n",
      " 7   HOME_TEAM_WINS   26552 non-null  int64  \n",
      "dtypes: float64(2), int64(5), object(1)\n",
      "memory usage: 1.8+ MB\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>GAME_DATE_EST</th>\n",
       "      <th>GAME_ID</th>\n",
       "      <th>HOME_TEAM_ID</th>\n",
       "      <th>VISITOR_TEAM_ID</th>\n",
       "      <th>SEASON</th>\n",
       "      <th>PTS_home</th>\n",
       "      <th>PTS_away</th>\n",
       "      <th>HOME_TEAM_WINS</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2022-12-22</td>\n",
       "      <td>22200477</td>\n",
       "      <td>1610612740</td>\n",
       "      <td>1610612759</td>\n",
       "      <td>2022</td>\n",
       "      <td>126.0</td>\n",
       "      <td>117.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2022-12-22</td>\n",
       "      <td>22200478</td>\n",
       "      <td>1610612762</td>\n",
       "      <td>1610612764</td>\n",
       "      <td>2022</td>\n",
       "      <td>120.0</td>\n",
       "      <td>112.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2022-12-21</td>\n",
       "      <td>22200466</td>\n",
       "      <td>1610612739</td>\n",
       "      <td>1610612749</td>\n",
       "      <td>2022</td>\n",
       "      <td>114.0</td>\n",
       "      <td>106.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2022-12-21</td>\n",
       "      <td>22200467</td>\n",
       "      <td>1610612755</td>\n",
       "      <td>1610612765</td>\n",
       "      <td>2022</td>\n",
       "      <td>113.0</td>\n",
       "      <td>93.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2022-12-21</td>\n",
       "      <td>22200468</td>\n",
       "      <td>1610612737</td>\n",
       "      <td>1610612741</td>\n",
       "      <td>2022</td>\n",
       "      <td>108.0</td>\n",
       "      <td>110.0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  GAME_DATE_EST   GAME_ID  HOME_TEAM_ID  VISITOR_TEAM_ID  SEASON  PTS_home  \\\n",
       "0    2022-12-22  22200477    1610612740       1610612759    2022     126.0   \n",
       "1    2022-12-22  22200478    1610612762       1610612764    2022     120.0   \n",
       "2    2022-12-21  22200466    1610612739       1610612749    2022     114.0   \n",
       "3    2022-12-21  22200467    1610612755       1610612765    2022     113.0   \n",
       "4    2022-12-21  22200468    1610612737       1610612741    2022     108.0   \n",
       "\n",
       "   PTS_away  HOME_TEAM_WINS  \n",
       "0     117.0               1  \n",
       "1     112.0               1  \n",
       "2     106.0               1  \n",
       "3      93.0               1  \n",
       "4     110.0               0  "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "games.info()\n",
    "games.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "e71c3e36",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 3130 entries, 0 to 3129\n",
      "Data columns (total 13 columns):\n",
      " #   Column             Non-Null Count  Dtype         \n",
      "---  ------             --------------  -----         \n",
      " 0   person_id          3130 non-null   int64         \n",
      " 1   first_name         3130 non-null   object        \n",
      " 2   last_name          3130 non-null   object        \n",
      " 3   birthdate          3130 non-null   datetime64[ns]\n",
      " 4   school             3130 non-null   object        \n",
      " 5   height             3130 non-null   object        \n",
      " 6   position           3130 non-null   object        \n",
      " 7   team_id            3130 non-null   int64         \n",
      " 8   team_name          3130 non-null   object        \n",
      " 9   team_city          3130 non-null   object        \n",
      " 10  team_abbreviation  3130 non-null   object        \n",
      " 11  draft_year         3130 non-null   object        \n",
      " 12  draft_round        3130 non-null   int64         \n",
      "dtypes: datetime64[ns](1), int64(3), object(9)\n",
      "memory usage: 318.0+ KB\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>person_id</th>\n",
       "      <th>first_name</th>\n",
       "      <th>last_name</th>\n",
       "      <th>birthdate</th>\n",
       "      <th>school</th>\n",
       "      <th>height</th>\n",
       "      <th>position</th>\n",
       "      <th>team_id</th>\n",
       "      <th>team_name</th>\n",
       "      <th>team_city</th>\n",
       "      <th>team_abbreviation</th>\n",
       "      <th>draft_year</th>\n",
       "      <th>draft_round</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>76001</td>\n",
       "      <td>Alaa</td>\n",
       "      <td>Abdelnaby</td>\n",
       "      <td>1968-06-24</td>\n",
       "      <td>Duke</td>\n",
       "      <td>6-10</td>\n",
       "      <td>Forward</td>\n",
       "      <td>1610612757</td>\n",
       "      <td>Trail Blazers</td>\n",
       "      <td>Portland</td>\n",
       "      <td>POR</td>\n",
       "      <td>1990</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>76003</td>\n",
       "      <td>Kareem</td>\n",
       "      <td>Abdul-Jabbar</td>\n",
       "      <td>1947-04-16</td>\n",
       "      <td>UCLA</td>\n",
       "      <td>7-2</td>\n",
       "      <td>Center</td>\n",
       "      <td>1610612747</td>\n",
       "      <td>Lakers</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>LAL</td>\n",
       "      <td>1969</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1505</td>\n",
       "      <td>Tariq</td>\n",
       "      <td>Abdul-Wahad</td>\n",
       "      <td>1974-11-03</td>\n",
       "      <td>San Jose State</td>\n",
       "      <td>6-6</td>\n",
       "      <td>Forward-Guard</td>\n",
       "      <td>1610612758</td>\n",
       "      <td>Kings</td>\n",
       "      <td>Sacramento</td>\n",
       "      <td>SAC</td>\n",
       "      <td>1997</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>949</td>\n",
       "      <td>Shareef</td>\n",
       "      <td>Abdur-Rahim</td>\n",
       "      <td>1976-12-11</td>\n",
       "      <td>California</td>\n",
       "      <td>6-9</td>\n",
       "      <td>Forward</td>\n",
       "      <td>1610612763</td>\n",
       "      <td>Grizzlies</td>\n",
       "      <td>Vancouver</td>\n",
       "      <td>VAN</td>\n",
       "      <td>1996</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>76005</td>\n",
       "      <td>Tom</td>\n",
       "      <td>Abernethy</td>\n",
       "      <td>1954-05-06</td>\n",
       "      <td>Indiana</td>\n",
       "      <td>6-7</td>\n",
       "      <td>Forward</td>\n",
       "      <td>1610612744</td>\n",
       "      <td>Warriors</td>\n",
       "      <td>Golden State</td>\n",
       "      <td>GOS</td>\n",
       "      <td>1976</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   person_id first_name     last_name  birthdate          school height  \\\n",
       "0      76001       Alaa     Abdelnaby 1968-06-24            Duke   6-10   \n",
       "1      76003     Kareem  Abdul-Jabbar 1947-04-16            UCLA    7-2   \n",
       "2       1505      Tariq   Abdul-Wahad 1974-11-03  San Jose State    6-6   \n",
       "3        949    Shareef   Abdur-Rahim 1976-12-11      California    6-9   \n",
       "4      76005        Tom     Abernethy 1954-05-06         Indiana    6-7   \n",
       "\n",
       "        position     team_id      team_name     team_city team_abbreviation  \\\n",
       "0        Forward  1610612757  Trail Blazers      Portland               POR   \n",
       "1         Center  1610612747         Lakers   Los Angeles               LAL   \n",
       "2  Forward-Guard  1610612758          Kings    Sacramento               SAC   \n",
       "3        Forward  1610612763      Grizzlies     Vancouver               VAN   \n",
       "4        Forward  1610612744       Warriors  Golden State               GOS   \n",
       "\n",
       "  draft_year  draft_round  \n",
       "0       1990            1  \n",
       "1       1969            1  \n",
       "2       1997            1  \n",
       "3       1996            1  \n",
       "4       1976            3  "
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "players.info()\n",
    "players.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "2d2e9f89",
   "metadata": {},
   "outputs": [],
   "source": [
    "players[\"birthdate\"] = pd.to_datetime(players[\"birthdate\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ffe819b0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "20e03131",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "541bea77",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 30 entries, 0 to 29\n",
      "Data columns (total 4 columns):\n",
      " #   Column             Non-Null Count  Dtype \n",
      "---  ------             --------------  ----- \n",
      " 0   team_id            30 non-null     int64 \n",
      " 1   team_name          30 non-null     object\n",
      " 2   team_city          30 non-null     object\n",
      " 3   team_abbreviation  30 non-null     object\n",
      "dtypes: int64(1), object(3)\n",
      "memory usage: 1.1+ KB\n"
     ]
    }
   ],
   "source": [
    "teams_unique.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "b4a83b0e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Definir un namespace pour notre graphe\n",
    "NBA = Namespace(\"https://example.org/nba/\")\n",
    "\n",
    "# Créer un graphe RDF\n",
    "g = Graph()\n",
    "\n",
    "# Ajouter des namespaces au graphe\n",
    "g.bind(\"nba\", NBA)\n",
    "g.bind(\"rdf\", RDF)\n",
    "g.bind(\"xsd\", XSD)\n",
    "\n",
    "# Ajouter des équipes au graphe\n",
    "for _, row in teams_unique.iterrows():\n",
    "    # Definir l'URI de l'équipe\n",
    "    teams_uri = URIRef(NBA[f\"{row[\"team_id\"]}\"]) \n",
    "    \n",
    "    # Ajouter le type de l'équipe\n",
    "    g.add((teams_uri, RDF.type, NBA.Team)) \n",
    "    \n",
    "    # Ajouter les propriétés de l'équipe\n",
    "    g.add((teams_uri, NBA.teamName, Literal(row[\"team_name\"], datatype=XSD.string))) # Ajouter le nom de l'équipe\n",
    "    g.add((teams_uri, NBA.teamCity, Literal(row[\"team_city\"], datatype=XSD.string))) # Ajouter la ville de l'équipe\n",
    "    g.add((teams_uri, NBA.teamAbbreviation, Literal(row[\"team_abbreviation\"], datatype=XSD.string))) # Ajouter l'abréviation de l'équipe\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "3a1ab44d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ajout des joueurs au graphe\n",
    "for _, row in players.iterrows():\n",
    "    # Definir l'URI du joueur\n",
    "    player_uri = URIRef(NBA[f\"{row[\"person_id\"]}\"])\n",
    "    \n",
    "    # Ajouter le type du joueur\n",
    "    g.add((player_uri, RDF.type, NBA.Player))\n",
    "    \n",
    "    # Ajouter les propriétés du joeur\n",
    "    g.add((player_uri, NBA.firstName, Literal(row[\"first_name\"], datatype=XSD.string))) # Ajouter le prénom du joueur\n",
    "    g.add((player_uri, NBA.lastName, Literal(row[\"last_name\"], datatype=XSD.string))) # Ajouter le nom du joueur\n",
    "    g.add((player_uri, NBA.birthdate, Literal(row[\"birthdate\"], datatype=XSD.date))) # Ajouter la date de naissance du joueur\n",
    "    g.add((player_uri, NBA.school, Literal(row[\"school\"], datatype=XSD.string))) # Ajouter l'école du joueur\n",
    "    g.add((player_uri, NBA.height, Literal(row[\"height\"], datatype=XSD.string))) # Ajouter la taille du joueur\n",
    "    g.add((player_uri, NBA.position, Literal(row[\"position\"], datatype=XSD.string))) # Ajouter la position du joueur\n",
    "    g.add((player_uri, NBA.draftYear, Literal(row[\"draft_year\"], datatype=XSD.gYear))) # Ajouter l'année de draft du joueur\n",
    "    g.add((player_uri, NBA.draftRound, Literal(row[\"draft_round\"], datatype=XSD.integer))) # Ajouter le round de draft du joueur\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "05c19667",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ajout the matchs au graphe\n",
    "for _, row in games.iterrows():\n",
    "    # Definir l'URI du match\n",
    "    game_uri = URIRef(NBA[f\"{row[\"GAME_ID\"]}\"])\n",
    "    \n",
    "    # Ajouter le type du match\n",
    "    g.add((game_uri, RDF.type, NBA.Game))\n",
    "    \n",
    "    # Ajouter les propriétés du match\n",
    "    g.add((game_uri, NBA.gameDate, Literal(row[\"GAME_DATE_EST\"], datatype=XSD.date))) # Ajouter la date du match\n",
    "    g.add((game_uri, NBA.season, Literal(row[\"SEASON\"], datatype=XSD.gYear))) # Ajouter la saison du match\n",
    "    g.add((game_uri, NBA.homeTeam, URIRef(NBA[f\"{row[\"HOME_TEAM_ID\"]}\"]))) # Ajouter l'équipe à domicile\n",
    "    g.add((game_uri, NBA.visitorTeam, URIRef(NBA[f\"{row[\"VISITOR_TEAM_ID\"]}\"]))) # Ajouter l'équipe à l'extérieur\n",
    "    g.add((game_uri, NBA.ptsHome, Literal(row[\"PTS_home\"], datatype=XSD.integer))) # Ajouter les points de l'équipe à domicile\n",
    "    g.add((game_uri, NBA.ptsAway, Literal(row[\"PTS_away\"], datatype=XSD.integer))) # Ajouter les points de l'équipe à l'extérieur\n",
    "    g.add((game_uri, NBA.homeTeamWins, Literal(row[\"HOME_TEAM_WINS\"], datatype=XSD.boolean))) # Ajouter si l'équipe à domicile a gagné\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "9b61b2ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "RDF intégré sauvegardé dans nba_graph.ttl\n"
     ]
    }
   ],
   "source": [
    "# Sauvegarder le graphe RDF dans un fichier Turtle\n",
    "g.serialize(destination='./turtles_files/nba_graph.ttl', format='turtle')\n",
    "print(\"RDF intégré sauvegardé dans nba_graph.ttl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "8b5c1f9a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# import pandas as pd\n",
    "# from rdflib import Graph, Namespace, Literal, XSD\n",
    "\n",
    "# # -----------------------\n",
    "# # 1️⃣ Charger les CSV\n",
    "# # -----------------------\n",
    "# players = pd.read_csv(\"players_cleaned.csv\")\n",
    "# teams = pd.read_csv(\"team.csv\")\n",
    "# games = pd.read_csv(\"games_cleaned.csv\")\n",
    "\n",
    "# # -----------------------\n",
    "# # -----------------------\n",
    "# # 3️⃣ Corriger les dates de naissance\n",
    "# # -----------------------\n",
    "# def complete_date(d):\n",
    "#     if pd.isna(d):\n",
    "#         return None\n",
    "#     s = str(d).strip()\n",
    "#     if len(s) == 7 and s[4] == '-':   # YYYY-MM → YYYY-MM-01\n",
    "#         return s + \"-01\"\n",
    "#     if len(s) == 10 and s[4] == '-' and s[7] == '-':  # YYYY-MM-DD\n",
    "#         return s\n",
    "#     return None\n",
    "\n",
    "# players['birthdate'] = players['birthdate'].apply(complete_date)\n",
    "\n",
    "# # -----------------------\n",
    "# # 4️⃣ Fonction sécurisée pour convertir en int\n",
    "# # -----------------------\n",
    "# def safe_int(val):\n",
    "#     try:\n",
    "#         return int(val)\n",
    "#     except (ValueError, TypeError):\n",
    "#         return None\n",
    "\n",
    "# # -----------------------\n",
    "# # 5️⃣ Créer le graphe RDF\n",
    "# # -----------------------\n",
    "# g = Graph()\n",
    "# ns = Namespace(\"http://example.org/basketball/\")\n",
    "\n",
    "# # Ajouter les équipes\n",
    "# for _, row in teams.iterrows():\n",
    "#     team_uri = ns[f\"Team/{row.team_id}\"]\n",
    "#     g.add((team_uri, ns.teamName, Literal(row.team_name)))\n",
    "#     g.add((team_uri, ns.teamCity, Literal(row.team_city)))\n",
    "#     g.add((team_uri, ns.teamAbbreviation, Literal(row.team_abbreviation)))\n",
    "\n",
    "# # Ajouter les joueurs\n",
    "# for _, row in players.iterrows():\n",
    "#     player_uri = ns[f\"Player/{row.person_id}\"]\n",
    "#     g.add((player_uri, ns.firstName, Literal(row.first_name)))\n",
    "#     g.add((player_uri, ns.lastName, Literal(row.last_name)))\n",
    "    \n",
    "#     if row.birthdate:\n",
    "#         g.add((player_uri, ns.birthdate, Literal(row.birthdate, datatype=XSD.date)))\n",
    "    \n",
    "#     g.add((player_uri, ns.height, Literal(row.height)))\n",
    "#     g.add((player_uri, ns.position, Literal(row.position)))\n",
    "#     g.add((player_uri, ns.playsFor, ns[f\"Team/{row.team_id}\"]))\n",
    "\n",
    "#     draft_year = safe_int(row.draft_year)\n",
    "#     if draft_year is not None:\n",
    "#         g.add((player_uri, ns.draftYear, Literal(draft_year)))\n",
    "\n",
    "#     draft_round = safe_int(row.draft_round)\n",
    "#     if draft_round is not None:\n",
    "#         g.add((player_uri, ns.draftRound, Literal(draft_round)))\n",
    "\n",
    "# # Ajouter les matchs\n",
    "# for _, row in games.iterrows():\n",
    "#     game_uri = ns[f\"Game/{row.GAME_ID}\"]\n",
    "#     g.add((game_uri, ns.gameDate, Literal(row.GAME_DATE_EST, datatype=XSD.date)))\n",
    "#     g.add((game_uri, ns.season, Literal(row.SEASON)))\n",
    "#     g.add((game_uri, ns.pointsHome, Literal(row.PTS_home)))\n",
    "#     g.add((game_uri, ns.pointsAway, Literal(row.PTS_away)))\n",
    "#     g.add((game_uri, ns.homeTeamWins, Literal(bool(row.HOME_TEAM_WINS))))\n",
    "#     g.add((game_uri, ns.homeTeam, ns[f\"Team/{row.HOME_TEAM_ID}\"]))\n",
    "#     g.add((game_uri, ns.visitorTeam, ns[f\"Team/{row.VISITOR_TEAM_ID}\"]))\n",
    "\n",
    "# # -----------------------\n",
    "# # 6️⃣ Sauvegarder en Turtle\n",
    "# # -----------------------\n",
    "# g.serialize(\"basketball.ttl\", format=\"turtle\")\n",
    "# print(\"RDF généré dans basketball.ttl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "ef51e5ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "# from rdflib import Graph\n",
    "\n",
    "# # Charger le graphe\n",
    "# g = Graph()\n",
    "# g.parse(\"basketball.ttl\", format=\"turtle\")\n",
    "\n",
    "# query = \"\"\"\n",
    "# PREFIX bb: <http://example.org/basketball/>\n",
    "\n",
    "# SELECT ?team (SUM(?points) AS ?totalPoints)\n",
    "# WHERE {\n",
    "#   {\n",
    "#     ?game bb:season 2006 ;\n",
    "#           bb:homeTeam ?team ;\n",
    "#           bb:pointsHome ?points .\n",
    "#   }\n",
    "#   UNION\n",
    "#   {\n",
    "#     ?game bb:season 2006 ;\n",
    "#           bb:visitorTeam ?team ;\n",
    "#           bb:pointsAway ?points .\n",
    "#   }\n",
    "# }\n",
    "# GROUP BY ?team\n",
    "# ORDER BY DESC(?totalPoints)\n",
    "# LIMIT 3\n",
    "# \"\"\"\n",
    "\n",
    "# results = g.query(query)\n",
    "\n",
    "# # Affichage\n",
    "# for row in results:\n",
    "#     team = row.team\n",
    "#     total_points = row.totalPoints\n",
    "#     print(f\"{team} → {total_points} points\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b77acdd7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "dff96f92",
   "metadata": {},
   "source": [
    "# Partie 3 : REQUETES SPARQL\n",
    "\n",
    "Le but de cette partie est d'extraire du graphe nouvellement crée certaines informations sur nos données grace à des requetes Sparql"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1dba9f5e",
   "metadata": {},
   "source": [
    "## Requete 1 : Afficher la page wikipedia de l'équipe ayant marquée le plus de points lors de la saison 2018"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "ea9cbf55",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON, XML\n",
    "from rdflib import Graph\n",
    "\n",
    "# Initialize your graph\n",
    "g.parse(\"./turtles_files/nba_graph.ttl\", format=\"turtle\")\n",
    "\n",
    "# Use SPARQLWrapper instead of direct SERVICE clause\n",
    "query_local = \"\"\"\n",
    "PREFIX nba: <https://example.org/nba/>\n",
    "SELECT ?teamName ?maxPoints\n",
    "WHERE {\n",
    "  {\n",
    "    SELECT ?team (MAX(?points) AS ?maxPoints)\n",
    "    WHERE {\n",
    "      ?game nba:gameDate ?date ;\n",
    "            (nba:HomeTeam | nba:visitorTeam) ?team ;\n",
    "            (nba:ptsHome | nba:ptsAway) ?points .\n",
    "      FILTER(YEAR(?date) = 2018)\n",
    "    }\n",
    "    GROUP BY ?team\n",
    "  \n",
    "  }\n",
    "  ?team nba:teamName ?teamName .\n",
    "}\n",
    "ORDER BY DESC(?maxPoints)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "# Execute local query first\n",
    "results_local = g.query(query_local)\n",
    "\n",
    "# Then query DBpedia separately\n",
    "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "\n",
    "final_results = []\n",
    "\n",
    "for row in results_local:\n",
    "    team_name = str(row.teamName)\n",
    "    \n",
    "    # Query DBpedia for this team\n",
    "    dbpedia_query = \"\"\"\n",
    "    PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "    SELECT ?dbpTeam ?wikiPage\n",
    "    WHERE {\n",
    "        ?dbpTeam foaf:name \"%s\"@en ;\n",
    "                 foaf:isPrimaryTopicOf ?wikiPage .\n",
    "    }\n",
    "    LIMIT 1\n",
    "    \"\"\" % team_name.replace('\"', '\\\\\"')\n",
    "    \n",
    "    sparql.setQuery(dbpedia_query)\n",
    "    try:\n",
    "        dbpedia_results = sparql.query().convert()\n",
    "        for dbp_row in dbpedia_results[\"results\"][\"bindings\"]:\n",
    "            final_results.append({\n",
    "                \"teamName\": team_name,\n",
    "                \"maxPoints\": row.maxPoints,\n",
    "                \"wikiPage\": dbp_row[\"wikiPage\"][\"value\"]\n",
    "            })\n",
    "    except Exception as e:\n",
    "        print(f\"Error querying DBpedia for {team_name}: {e}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "264975e4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   teamName maxPoints                                  wikiPage\n",
      "0  Warriors     149.0  http://en.wikipedia.org/wiki/Warriors_FC\n"
     ]
    }
   ],
   "source": [
    "print(pd.DataFrame(final_results))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "46e829b0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# g.parse(\"./turtles_files/nba_graph.ttl\", format=\"turtle\")\n",
    "# query = \"\"\"\n",
    "# SELECT ?teamName ?points ?date\n",
    "# WHERE {\n",
    "#   ?game nba:gameDate ?date ;\n",
    "#         (nba:ptsHome | nba:ptsAway) ?points .\n",
    "#   ?team nba:teamName ?teamName .\n",
    "#   FILTER(YEAR(?date) = 2018)\n",
    "# }\n",
    "# ORDER BY DESC(?points)\n",
    "# LIMIT 5\n",
    "# \"\"\"\n",
    "# results = g.query(query)\n",
    "# for row in results:\n",
    "#     print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7e21c57b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8792e0c0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "219a1b5b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N1c22f58530ae42e9bc972a0e3ac2f7f9 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3f76c4cb",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
